_posts/2014-05-20-volatile_in_c.html
---
layout: post
title: Volatile关键字
---
<div id="outline-container-orgad4e2f1" class="outline-2">
<h2 id="orgad4e2f1"><span class="section-number-2">1.</span> volatile</h2>
<div class="outline-text-2" id="text-1">
<p>
防止编译器的某些优化措施，
在c/c++中的作用，
</p>
<ol class="org-ol">
<li>可以访问内存映射设备</li>
<li>setjmp和longjmp使用</li>
<li>信号处理函数中使用sig<sub>atomic</sub><sub>t变量</sub></li>
</ol>


<p>
需要注意的问题：不是原子操作，不能保证happens-before的关系，后面的Java按照何文所说是可以的。
</p>
</div>
<div id="outline-container-orgdcc522c" class="outline-3">
<h3 id="orgdcc522c"><span class="section-number-3">1.1.</span> volatile in c</h3>
<div class="outline-text-3" id="text-1-1">
<p>
wiki中的例子，说明了其一个用法，向编译器声明这个变量是会变化的：即使在目前的代码中可能没有变化，但是会被其他的外部因素转变（可以认为是存在外部影响的副作用，造成该变量的改变）。
</p>

<p>
后面的汇编代码比较中可以看到，没有volatile关键字的变量，编译器会认为不会存在外部环境的介入影响变量值，故，一旦存在确定的数值，都会直接代替。存在volatile后，由于表明该变量会有外部副作用改变，编译器在任何一个时刻都默认这个值可能会改变，都需要从地址中重新取值。
</p>

<p>
在c++11标准中，其只用于访问硬件，线程内部的通讯都会使用标准库的 std::atomic&lt;T&gt;。
</p>
</div>
</div>
<div id="outline-container-orgb1fd5a9" class="outline-3">
<h3 id="orgb1fd5a9"><span class="section-number-3">1.2.</span> 针对kernel代码</h3>
<div class="outline-text-3" id="text-1-2">
<blockquote>
<p>
In other words, they have been known to treat volatile types
as a sort of easy atomic variable, which they are not.  The use of volatile in
kernel code is almost never correct;
</p>
</blockquote>
<p>
在有锁的情况下，不需要在加锁的代码区间中再增加volatile关键字，因为编译器已经知道优化范围，会在这一区间中进行优化，而非完全的去除优化，从而降低代码效率。<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
最初volatile的目的是用于处理memory-mapped I/O registers的，但是在kernel中，对寄存器的访问也是需要加锁的，但是I/O memory访问是通过函数(accessor functions)进行的，而非直接通过指针获得内存数据。而函数中已经做了措施防止不必要的优化。<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
部分可能出现的情况：
</p>
<ol class="org-ol">
<li>上面的accessor function内可能会使用。</li>
<li>内联的汇编代码，改变了内存，但是没有可见的副作用，可能会被gcc优化掉。</li>
<li>jiffies变量，每次都会变化，而且读取也不用加锁。但是其他的类似变量还是最好用锁。</li>
<li>指针可能会被IO设备改变的情况。</li>
</ol>


<p>
可见使用的绝大部分场景都是和硬件IO交互的时候使用，也即编译器无法控制的因素而且也没有什么固定的协议可以遵循，如果有了固定的协议在编译期就可以判断遵循，其实编译器也可以处理。
</p>
</div>
</div>
<div id="outline-container-org29bfdb1" class="outline-3">
<h3 id="org29bfdb1"><span class="section-number-3">1.3.</span> 何登成一文</h3>
<div class="outline-text-3" id="text-1-3">
<p>
文中的前两个对比说明的就是易变性和不可优化，其实最后还是集中在不可优化这一点上。如果我们将寄存器也看作是内存的缓存，那么编译器进行的寄存器的分配等等都是针对缓存的优化算法，如果将寄存器、L1等等cache都简化掉【而这些其实都是属于优化措施】，那么剩下的很显然就不存在易变性这个问题。
</p>

<p>
第三个的顺序性问题：
</p>
<ul class="org-ul">
<li>首先涉及的是编译器的指令重排问题，编译后的代码是不能认为就是源代码中的执行顺序。除非可以在这段代码区间内去除代码重排的功能。所以设定所有的变量都是volatile可以解决这个问题，或者关闭优化，其实这符合kernel中的说明，关了优化影响性能，加锁能保证，而且还可以针对性的优化。</li>
<li>其次，硬件上的CPU优化也会乱序执行指令。这样最后也是最弱的前提也消失掉了，完全失去使用的意义。除非不要编译器的优化和硬件优化。</li>
</ul>

<p>
最后还是优化措施的引入造成的数据一致性的问题，解决的方法自然是增加优化的控制范围，减少和控制不想要的优化。后面历史那段貌似就是说本用于与memory-mapped IO设备交互的需要，编译器对硬件级别的副作用难以识别。
</p>
</div>
</div>
<div id="outline-container-orgd0af7f1" class="outline-3">
<h3 id="orgd0af7f1"><span class="section-number-3">1.4.</span> Java</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Java中，保证了上面的第三个顺序性问题，所以可以拿来用，应该是1.5版本以后。回头再仔细看看&#x2026;.
</p>

<p>
综上，Java里可以用，c/c++里要是有用的，可以考虑直接当bug处理，毕竟需要使用的场景概率太小了。
</p>
</div>
</div>
</div>
<div id="outline-container-orge07143f" class="outline-2">
<h2 id="orge07143f"><span class="section-number-2">2.</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/Volatile_variable">http://en.wikipedia.org/wiki/Volatile_variable</a></li>
<li><a href="http://hedengcheng.com/?p=725">http://hedengcheng.com/?p=725</a></li>
<li><a href="https://www.kernel.org/doc/Documentation/volatile-considered-harmful.txt">https://www.kernel.org/doc/Documentation/volatile-considered-harmful.txt</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
这里不仅仅针对的是kernel，应用层也一样。
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
另有一个busy-waiting的情况，待查。
</p></div></div>


</div>
</div>
